In [2]:
import os
current_directory = os.getcwd()
print("Current Directory:", current_directory)

Current Directory: C:\Users\user\Desktop\Desktop_old2\Python_course_data_structures_algorithms

In [3]:
# Use a raw string
os.chdir(r"C:\Users\user\Desktop\Desktop_old2\Python_course_data_structures_algorithms\Python-Data-Wrangling-main\data")
current_directory = os.getcwd()
print("Current Directory:", current_directory)

Current Directory: C:\Users\user\Desktop\Desktop_old2\Python_course_data_structures_algorithms\Python-Data-Wrangling-main\data

In [4]:
files = os.listdir('.')
print(files)

['cleaned_country_totals.csv', 'countries.csv', 'country_total.csv']

In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [6]:
# Pandas Series

In [7]:
# A Pandas Series is a one-dimensional array-like object in the Pandas library that can hold a variety of data types, 
# including integers, floats, strings, and Python objects. 
# It is similar to a column in a spreadsheet or a database table but operates more like a dictionary, 
# as it has both data values and an associated index.

In [8]:
# One-dimensional: It is a single column of data, unlike a DataFrame, which is two-dimensional (rows and columns).
# Labeled Index: Each element in the Series is associated with an index, which can be either numeric (default) or custom (like a list of labels).
# Flexible Data Types: A Series can hold any data type—numbers, strings, or more complex objects.

In [9]:
import pandas as pd

data = [10, 20, 30, 40]
series = pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
dtype: int64

In [10]:
# Custom index example :
data = [100, 200, 300]
index = ['a', 'b', 'c']
series = pd.Series(data, index=index)
print(series)

a    100
b    200
c    300
dtype: int64

In [11]:
print(series['b'])  # Output: 200 # Accessing the values

200

In [12]:
series * 2 # Vectorized operations

a    200
b    400
c    600
dtype: int64

In [13]:
# Pandas DataFrames

In [14]:
# A Pandas DataFrame is a two-dimensional, table-like data structure that allows you to store and manipulate data in rows and columns, 
# similar to a spreadsheet or SQL table. It is one of the most commonly used data structures in the Pandas library and is highly flexible 
# for data analysis and manipulation tasks.

# Key Characteristics of a DataFrame:

# Two-Dimensional: It has rows and columns, which makes it ideal for representing datasets where each row represents an observation and 
# each column represents a feature or variable.

# Labeled Axes (Rows and Columns): Like a Series, a DataFrame has an index for rows, but it also has column labels. 
# Both rows and columns can be accessed and modified by label or integer position.

# Heterogeneous Data: Different columns in a DataFrame can hold different data types (e.g., integers, floats, strings, or even complex data types 
# like lists or objects).

In [15]:
# Example 1: Creating from a Dictionary

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'Occupation': ['Engineer', 'Doctor', 'Artist']
}
df = pd.DataFrame(data)
print(df)

      Name  Age Occupation
0    Alice   25   Engineer
1      Bob   30     Doctor
2  Charlie   35     Artist

In [16]:
# Example 2: Creating from a List of Lists

data = [['Alice', 25, 'Engineer'], ['Bob', 30, 'Doctor'], ['Charlie', 35, 'Artist']]
df = pd.DataFrame(data, columns=['Name', 'Age', 'Occupation'])
print(df)

      Name  Age Occupation
0    Alice   25   Engineer
1      Bob   30     Doctor
2  Charlie   35     Artist

In [17]:
# additional operations :
df.dropna()  # Removes rows with missing data
df.fillna(0)  # Replaces missing data with 0

      Name  Age Occupation
0    Alice   25   Engineer
1      Bob   30     Doctor
2  Charlie   35     Artist

In [18]:
# Working with another dataframe

In [19]:
unemployment = pd.read_csv('country_total.csv')
type(unemployment)

pandas.core.frame.DataFrame

In [20]:
unemployment.head(4)

  country seasonality    month  unemployment  unemployment_rate
0      at         nsa  1993.01        171000                4.5
1      at         nsa  1993.02        175000                4.6
2      at         nsa  1993.03        166000                4.4
3      at         nsa  1993.04        157000                4.1

In [21]:
unemployment.tail(4)

      country seasonality    month  unemployment  unemployment_rate
20792      uk       trend  2010.07       2422000                7.7
20793      uk       trend  2010.08       2429000                7.7
20794      uk       trend  2010.09       2447000                7.8
20795      uk       trend  2010.10       2455000                7.8

In [22]:
unemployment.shape

(20796, 5)

In [23]:
unemployment.columns

Index(['country', 'seasonality', 'month', 'unemployment', 'unemployment_rate'], dtype='object')

In [24]:
unemployment.dtypes

country               object
seasonality           object
month                float64
unemployment           int64
unemployment_rate    float64
dtype: object

In [26]:
countries_url = 'https://raw.githubusercontent.com/dlab-berkeley/Python-Data-Wrangling/main/data/countries.csv'
countries = pd.read_csv(countries_url)
countries.shape

(30, 8)

In [27]:
countries.head(3)

,country,google_country_code,country_group,name_en,name_fr,name_de,latitude,longitude
0,at,AT,eu,Austria,Autriche,Österreich,47.696554,13.345980
1,be,BE,eu,Belgium,Belgique,Belgien,50.501045,4.476674
2,bg,BG,eu,Bulgaria,Bulgarie,Bulgarien,42.725674,25.482322

In [28]:
countries.tail(3)

,country,google_country_code,country_group,name_en,name_fr,name_de,latitude,longitude
27,se,SE,eu,Sweden,Suède,Schweden,62.198467,14.896307
28,tr,TR,non-eu,Turkey,Turquie,Türkei,38.952942,35.439795
29,uk,GB,eu,United Kingdom,Royaume-Uni,Vereinigtes Königreich,54.315447,-2.232612

In [29]:
countries.columns

Index(['country', 'google_country_code', 'country_group', 'name_en', 'name_fr',
       'name_de', 'latitude', 'longitude'],
      dtype='object')

In [30]:
pd.set_option('display.max_rows', 10)
countries.describe()
pd.reset_option('display.max_rows')

In [31]:
# INDEXING with .loc

# In Pandas, loc[] is primarily used for label-based indexing, 
# allowing you to access a group of rows and columns by their labels or a boolean array. 
# It provides a powerful way to select data by specifying row and column labels explicitly.
# df.loc['row_label']
# df.loc[['row_label1', 'row_label2']]
# df.loc['row_label', 'column_label']
# df.loc['start_label':'end_label'] # range of rows
# df.loc[df['column_name'] > 10]
# df.loc['row_label', ['col1', 'col2']]

In [32]:
my_list = ['a', 'b', 'c', 'd', 'e', 'f']
my_list
my_list[:4]

['a', 'b', 'c', 'd']

In [33]:
my_list[0]
my_list[2:]

['c', 'd', 'e', 'f']

In [34]:
countries.loc[3, 'google_country_code']

'HR'

In [35]:
# .loc allows us to index data based on the labels of our DataFrame's index and its column names. 
countries.loc[:4, :]

,country,google_country_code,country_group,name_en,name_fr,name_de,latitude,longitude
0,at,AT,eu,Austria,Autriche,Österreich,47.696554,13.345980
1,be,BE,eu,Belgium,Belgique,Belgien,50.501045,4.476674
2,bg,BG,eu,Bulgaria,Bulgarie,Bulgarien,42.725674,25.482322
3,hr,HR,non-eu,Croatia,Croatie,Kroatien,44.746643,15.340844
4,cy,CY,eu,Cyprus,Chypre,Zypern,35.129141,33.428682

In [36]:
countries.loc[2:4, 'name_en']

2    Bulgaria
3     Croatia
4      Cyprus
Name: name_en, dtype: object

In [37]:
type(countries.loc[2:4, 'name_en'])

pandas.core.series.Series

In [38]:
# INDEXING with .iloc : INTEGER LOCATION 

# In Pandas, iloc is used for integer-location-based indexing, which allows you to select data by position rather than labels. 
# This is particularly useful when you want to access data by its numeric index (row/column number) rather than its name.

In [39]:
countries.head(4)

,country,google_country_code,country_group,name_en,name_fr,name_de,latitude,longitude
0,at,AT,eu,Austria,Autriche,Österreich,47.696554,13.345980
1,be,BE,eu,Belgium,Belgique,Belgien,50.501045,4.476674
2,bg,BG,eu,Bulgaria,Bulgarie,Bulgarien,42.725674,25.482322
3,hr,HR,non-eu,Croatia,Croatie,Kroatien,44.746643,15.340844

In [40]:
countries.iloc[0:4, 1]  # Selects the second column (index 1)

0    AT
1    BE
2    BG
3    HR
Name: google_country_code, dtype: object

In [41]:
countries.iloc[1:4, 0:2]  # Selects rows 1 to 3 and columns 0 to 1

  country google_country_code
1      be                  BE
2      bg                  BG
3      hr                  HR

In [42]:
# Non-contiguous rows and columns
countries.iloc[[0, 3], [1, 2]]  # Selects rows 0 and 3, and columns 1 and 2

  google_country_code country_group
0                  AT            eu
3                  HR        non-eu

In [43]:
# Using Negative Indexing: Like Python’s standard negative indexing, you can use negative integers in iloc to count from the end.

In [44]:
countries.iloc[-1]  # Selects the last row

country                                    uk
google_country_code                        GB
country_group                              eu
name_en                        United Kingdom
name_fr                           Royaume-Uni
name_de                Vereinigtes Königreich
latitude                            54.315447
longitude                           -2.232612
Name: 29, dtype: object

In [45]:
countries.iloc[0:2, -2:]  # Selects the last two columns

    latitude  longitude
0  47.696554  13.345980
1  50.501045   4.476674

In [46]:
countries.iloc[ 0:2, [0,4,5] ]

  country   name_fr     name_de
0      at  Autriche  Österreich
1      be  Belgique     Belgien

In [47]:
# Boolean Indexing

# Boolean indexing in Pandas is a powerful way to filter data in a DataFrame or Series based on conditions that return either True or False. 
# This method allows you to select specific rows or columns from your data based on logical conditions, 
# making it easier to analyze and manipulate datasets.

# filtered_df = df[condition]  # Returns rows where Age > 30
# print(filtered_df)

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'Score': [88, 92, 85, 90]
}

df = pd.DataFrame(data)
filtered_df = df[(df['Age'] > 30) & (df['Score'] > 85)]
print(filtered_df)

    Name  Age  Score
3  David   40     90

In [48]:
# Example: find countries outside the EU

In [49]:
test = countries.loc[20:25, :]
test.head(6)

,country,google_country_code,country_group,name_en,name_fr,name_de,latitude,longitude
20,no,NO,non-eu,Norway,Norvège,Norwegen,64.556460,12.665766
21,pl,PL,eu,Poland,Pologne,Polen,51.918907,19.134334
22,pt,PT,eu,Portugal,Portugal,Portugal,39.558069,-7.844941
23,ro,RO,eu,Romania,Roumanie,Rumänien,45.942611,24.990152
24,sk,SK,eu,Slovakia,Slovaquie,Slowakei,48.672644,19.700032
25,si,SI,eu,Slovenia,Slovénie,Slowenien,46.149259,14.986617

In [50]:
test['country_group']

20    non-eu
21        eu
22        eu
23        eu
24        eu
25        eu
Name: country_group, dtype: object

In [51]:
test['country_group'] == 'non-eu'

20     True
21    False
22    False
23    False
24    False
25    False
Name: country_group, dtype: bool

In [52]:
# Use the boolean mask to index only those rows that satisfied the test: test[test['country_group'] == 'non-eu']
test[test['country_group'] == 'non-eu']

,country,google_country_code,country_group,name_en,name_fr,name_de,latitude,longitude
20,no,NO,non-eu,Norway,Norvège,Norwegen,64.55646,12.665766

In [53]:
countries[countries['longitude'] > 25]

,country,google_country_code,country_group,name_en,name_fr,name_de,latitude,longitude
2,bg,BG,eu,Bulgaria,Bulgarie,Bulgarien,42.725674,25.482322
4,cy,CY,eu,Cyprus,Chypre,Zypern,35.129141,33.428682
7,ee,EE,eu,Estonia,Estonie,Estland,58.592469,25.806950
8,fi,FI,eu,Finland,Finlande,Finnland,64.950159,26.067564
28,tr,TR,non-eu,Turkey,Turquie,Türkei,38.952942,35.439795

In [54]:
# Find the average longitude of countries in our data, assign it to the variable average_long
average_long =  test['longitude'].mean()
print(average_long) 

# Find countries that have "above average" longitude 
test['longitude'] > average_long

13.9386599

20    False
21     True
22    False
23     True
24     True
25     True
Name: longitude, dtype: bool

In [55]:
# Boolean Indexing with multiple conditions

# Select the countries with longitude greater than 25 but less than 30
countries[(countries['longitude'] > 25) & (countries['longitude'] < 30)]

,country,google_country_code,country_group,name_en,name_fr,name_de,latitude,longitude
2,bg,BG,eu,Bulgaria,Bulgarie,Bulgarien,42.725674,25.482322
7,ee,EE,eu,Estonia,Estonie,Estland,58.592469,25.806950
8,fi,FI,eu,Finland,Finlande,Finnland,64.950159,26.067564

In [56]:
# Boolean Indexing with multiple conditions

# Select the countries with longitude greater than 30 or less than 0
countries[(countries['longitude'] > 30) | (countries['longitude'] < 0)]

,country,google_country_code,country_group,name_en,name_fr,name_de,latitude,longitude
4,cy,CY,eu,Cyprus,Chypre,Zypern,35.129141,33.428682
13,ie,IE,eu,Ireland,Irlande,Irland,53.415260,-8.239122
22,pt,PT,eu,Portugal,Portugal,Portugal,39.558069,-7.844941
26,es,ES,eu,Spain,Espagne,Spanien,39.895013,-2.988296
28,tr,TR,non-eu,Turkey,Turquie,Türkei,38.952942,35.439795
29,uk,GB,eu,United Kingdom,Royaume-Uni,Vereinigtes Königreich,54.315447,-2.232612

In [57]:
# Computing Missing Values

In [58]:
unemployment = pd.read_csv('country_total.csv')
type(unemployment)
unemployment.shape

(20796, 5)

In [59]:
# Missing Values

In [60]:
unemployment.isna().sum()

country                0
seasonality            0
month                  0
unemployment           0
unemployment_rate    945
dtype: int64

In [61]:
# Dealing with missing data. One basic approach would be to drop any row with a missing unemployment rate record.

In [62]:
# To drop any row with a missing unemployment rate record:

unemployment = unemployment.dropna(subset=['unemployment_rate'])
unemployment.head(6)

  country seasonality    month  unemployment  unemployment_rate
0      at         nsa  1993.01        171000                4.5
1      at         nsa  1993.02        175000                4.6
2      at         nsa  1993.03        166000                4.4
3      at         nsa  1993.04        157000                4.1
4      at         nsa  1993.05        147000                3.9
5      at         nsa  1993.06        134000                3.5

In [63]:
# Sorting Values
# the country with the highest unemployment rates 

unemployment.sort_values(by='unemployment_rate', ascending=False).head(1)

      country seasonality    month  unemployment  unemployment_rate
15526      pl         nsa  2004.02       3531000               20.9

In [64]:
# Merging DataFrames

unemployment.shape
countries.shape

(30, 8)

In [65]:
unemployment_merged = pd.merge(unemployment, countries, on='country')
unemployment_merged.head(6)

,country,seasonality,month,unemployment,unemployment_rate,google_country_code,country_group,name_en,name_fr,name_de,latitude,longitude
0,at,nsa,1993.01,171000,4.5,AT,eu,Austria,Autriche,Österreich,47.696554,13.34598
1,at,nsa,1993.02,175000,4.6,AT,eu,Austria,Autriche,Österreich,47.696554,13.34598
2,at,nsa,1993.03,166000,4.4,AT,eu,Austria,Autriche,Österreich,47.696554,13.34598
3,at,nsa,1993.04,157000,4.1,AT,eu,Austria,Autriche,Österreich,47.696554,13.34598
4,at,nsa,1993.05,147000,3.9,AT,eu,Austria,Autriche,Österreich,47.696554,13.34598
5,at,nsa,1993.06,134000,3.5,AT,eu,Austria,Autriche,Österreich,47.696554,13.34598

In [66]:
# Grouping and Aggregating Data

# What if we'd like to know how many observations exist for each country? To do so, we need to group the countries, 
# then count how many times each one occurs. 
# The "group-by" operation is a fundamental technique used with tabular data.

In [67]:
# VALUE_COUNTS

In [68]:
# Simple Grouping with .value_counts()
# We typically run this on a single column, and it will return a table showing 
# how many observations there are for each unique value in the column.

In [69]:
unemployment_merged['name_en'].value_counts().tail(5)

name_en
Cyprus      396
Bulgaria    396
Estonia     387
Turkey      210
Croatia     108
Name: count, dtype: int64

In [70]:
# .value_counts() on the DataFrame to find out how many observations are from EU versus non-EU records
unemployment_merged[unemployment_merged["country_group"] == "eu"].country.value_counts().head(5)

country
ie    1008
fr    1008
se    1008
pt    1008
nl    1008
Name: count, dtype: int64

In [71]:
# .value_counts() on the DataFrame to find out how many observations are from EU versus non-EU records
unemployment_merged[unemployment_merged["country_group"] != "eu"].country.value_counts().head(5)

country
no    786
tr    210
hr    108
Name: count, dtype: int64

In [72]:
unemployment_merged['country_group'].value_counts()

country_group
eu        18747
non-eu     1104
Name: count, dtype: int64

In [73]:
# GROUPBY()

In [74]:
# Complex grouping with .groupby()
# What if we want to do something more complex, like find out what was the average unemployment rate for EU and non-EU countries?. 
# .value_counts() groups data then counts it, but we need a method that can group data then average it.

# .groupby() -- allows us to group data then apply any aggregate function we want -- count, average, min, max, median, etc.

In [75]:
#  It doesn't actually return data or output -- it just groups the data
unemployment_merged.groupby('country_group')

In [76]:
# to select a column of data and specify an aggregate function.

unemployment_merged.groupby('country_group')['unemployment_rate'].mean()

country_group
eu        8.303382
non-eu    6.080616
Name: unemployment_rate, dtype: float64

In [77]:
unemployment_merged.groupby('country_group')['unemployment_rate'].mean()

country_group
eu        8.303382
non-eu    6.080616
Name: unemployment_rate, dtype: float64

In [78]:
# To confirm the behavior using boolean indexing as well.

boolean_index = unemployment_merged['country_group'] == 'eu'
boolean_index.head(5)
unemployment_merged.loc[boolean_index, 'unemployment_rate'].mean()

8.30338187443324

In [79]:
# To confirm the behavior using boolean indexing as well.

boolean_index = unemployment_merged['country_group'] != 'eu'
boolean_index.head(5)
unemployment_merged.loc[boolean_index, 'unemployment_rate'].mean()

6.080615942028985

In [80]:
# Use .groupby() to find the maximum unemployment rate for each country. Sort your results from largest to smallest.
grouped = unemployment_merged.groupby('name_en')['unemployment_rate'].max().sort_values(ascending = False).head(5)

In [81]:
# Data visualization in Pandas

In [82]:
grouped = unemployment_merged.groupby('name_en')
grouped